# Bar Terminations Data Methods

Source: https://www.revitapidocs.com/2026/f150fadf-21a7-6e7b-9c76-4d7e15343cfb.htm

---

| Bar Terminations Data Methods |
| --- |

The BarTerminationsData type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | AsRebarShapeTerminationsData | Creates a new instance of RebarShapeTerminationsData from this. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetDocument | Gets the document containing the hook type ids, end treatment ids and crank type ids. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace